app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "7DqeTRBvQ7llDbd4l8MtmA"], ["updated_at", "2020-12-08 21:42:52.161985"], ["id", 3]]
---
    def reset_session_token
        self.session_token = SecureRandom.urlsafe_base64
        self.save